ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_pwrcu.c
/*********************************************************************************************************//**
 * @brief Return the flag status of LVD.
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus PWRCU_GetLVDFlagStatus(void)
{
  return (FlagStatus)Get_LVDF;
}

/*********************************************************************************************************//**
 * @brief Return the flag status of BOD.
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus PWRCU_GetBODFlagStatus(void)
{
  return (FlagStatus)Get_BODF;
}

/*********************************************************************************************************//**
 * @brief Configure the LDO operation mode.
 * @param Sel: Specify the LDO mode.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_LDO_NORMAL     : The LDO is operated in normal current mode
 *     @arg PWRCU_LDO_LOWCURRENT : The LDO is operated in low current mode
 * @retval None
 ************************************************************************************************************/
void PWRCU_LDOConfig(PWRCU_LDOMODE_Enum Sel)
{
  u32 uRTCStatus = 0;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_LDOMODE(Sel));

  uRTCStatus = Get_VDDREN;
  Set_VDDREN;

  if (Sel == PWRCU_LDO_NORMAL)
  {
    Reset_LDOMODE;
  }
  else
  {
    Set_LDOMODE;
  }

  if (uRTCStatus == 0)
  {
    Reset_VDDREN;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the LVD interrupt wakeup function.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_LVDIntWakeupConfig(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    Set_LVDIWEN;
  }
  else
  {
    Reset_LVDIWEN;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the LVD event wakeup function.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_LVDEventWakeupConfig(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    Set_LVDEWEN;
  }
  else
  {
    Reset_LVDEWEN;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the external WAKEUP pin function.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_WakeupPinCmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    Set_WUP0EN;
  }
  else
  {
    Reset_WUP0EN;
  }
}

#if (LIBCFG_PWRCU_WAKEUP_V01)
/*********************************************************************************************************//**
 * @brief Enable or Disable the external WAKEUP pin function.
 * @param Pin: specify the WAKEUP pin number.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_WAKEUP_PIN_0 :
 *     @arg PWRCU_WAKEUP_PIN_1 :
 * @param Type: specify the WAKEUP pin type.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_WUP_POSITIVE_EDGE :
 *     @arg PWRCU_WUP_NEGATIVE_EDGE :
 *     @arg PWRCU_WUP_HIGH_LEVEL    :
 *     @arg PWRCU_WUP_LOW_LEVEL     :
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_WakeupMultiPinCmd(PWRCU_WUP_Enum Pin, PWRCU_WUPTYPE_Enum Type, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_WAKEUPPIN(Pin));
  Assert_Param(IS_PWRCU_TRIGGERTYPE(Type));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    if (Pin == PWRCU_WAKEUP_PIN_0)
    {
      HT_PWRCU->CR = (HT_PWRCU->CR & WUP0TYPE_MASK) | (Type << 16);
      Set_WUP0EN;
    }
    else
    {
      HT_PWRCU->CR = (HT_PWRCU->CR & WUP1TYPE_MASK) | (Type << 18);
      Set_WUP1EN;
    }
  }
  else
  {
    if (Pin == PWRCU_WAKEUP_PIN_0)
      Reset_WUP0EN;
    else
      Reset_WUP1EN;
  }
}
#endif

/*********************************************************************************************************//**
 * @brief Force the Ultra-low Power to turn off.
 * @retval None
 * @note !!! This bit ULDOOFF will be clear to 0 when the MCU is into the Power-Down or Deep Power-Down mode,
         VDD power domain reset.
 ************************************************************************************************************/
void PWRCU_ForceTurnOffULDO(void)
{
  Set_ULDOOFF;
}

#if (LIBCFG_PWRCU_WAKEUPBKUCLR)
/*********************************************************************************************************//**
 * @brief Enable or Disable the external WAKEUP pin trigger the erase backup register function.
 * @param Pin: specify the WAKEUP pin number.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_WAKEUP_PIN_0 :
 *     @arg PWRCU_WAKEUP_PIN_1 :
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_WakeupPinEraseBakRegCmd(PWRCU_WUP_Enum Pin, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_WAKEUPPIN(Pin));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    if (Pin == PWRCU_WAKEUP_PIN_0)
      Set_ERBKR;
    else
      Set_ERBKR1;
  }
  else
  {
    if (Pin == PWRCU_WAKEUP_PIN_0)
      Reset_ERBKR;
    else
      Reset_ERBKR1;
  }
}
#endif

#if (LIBCFG_PWRCU_WAKEUPTIMESTAMP)
/*********************************************************************************************************//**
 * @brief Enable or Disable the external WAKEUP pin trigger the timestamp function.
 * @param Pin: specify the WAKEUP pin number.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_WAKEUP_PIN_0 :
 *     @arg PWRCU_WAKEUP_PIN_1 :
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_WakeupPinTimeStampCmd(PWRCU_WUP_Enum Pin, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_WAKEUPPIN(Pin));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    if (Pin == PWRCU_WAKEUP_PIN_0)
      Set_TMSTP;
    else
    {
      Set_TMSTP1;
    }
  }
  else
  {
    if (Pin == PWRCU_WAKEUP_PIN_0)
      Reset_TMSTP;
    else
      Reset_TMSTP1;
  }
}
#endif

#if (LIBCFG_PWRCU_WAKEUPFILTER)
/*********************************************************************************************************//**
 * @brief Set the external WAKEUP pin filter count.
 * @param Pin: specify the WAKEUP pin number.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_WAKEUP_PIN_0   :
 *     @arg PWRCU_WAKEUP_PIN_1   :
 * @param Count: specify the WAKEUP pin signal filter count.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_WUPFLT_COUNT2  :
 *     @arg PWRCU_WUPFLT_COUNT4  :
 *     @arg PWRCU_WUPFLT_COUNT8  :
 *     @arg PWRCU_WUPFLT_COUNT16 :
 * @retval None
 ************************************************************************************************************/
void PWRCU_SetWakeupPinFilter(PWRCU_WUP_Enum Pin , PWRCU_WUPFLT_Enum Count)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_WAKEUPPIN(Pin));
  Assert_Param(IS_PWRCU_WUPFLT(Count));

  if (Pin == PWRCU_WAKEUP_PIN_0)
  {
    HT_PWRCU->CR1 = (HT_PWRCU->CR1 & WUP0FLT_MASK) | (Count << WUP0FLT_Pos);
  }
  else
  {
    HT_PWRCU->CR1 = (HT_PWRCU->CR1 & WUP1FLT_MASK) | (Count << WUP1FLT_Pos);
  }
}

/*********************************************************************************************************//**
 * @brief Set the external WAKEUP pin Sampling Frequency.
 * @param WAKEPRE: specify the WAKEUP pin sampling frequency prescaler.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_WUPFREQ_DIV1 :
 *     @arg PWRCU_WUPFREQ_DIV2 :
 *     @arg PWRCU_WUPFREQ_DIV4 :
 *     @arg PWRCU_WUPFREQ_DIV8 :
 * @retval None
 ************************************************************************************************************/
void PWRCU_SetWakeupPinFilterPrescaler(PWRCU_WUPFREQ_Enum WAKEPRE)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_WUPFREQ(WAKEPRE));

  HT_PWRCU->CR1 = (HT_PWRCU->CR1 & WUPFREQ_MASK) | WAKEPRE;
}
#endif

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
